import "/src/scss/style.scss";
("use strict");
window.addEventListener("DOMContentLoaded", () => {
  const inputUa = document.querySelector("#ua");
  const inputUsd = document.querySelector("#usd");

  // Слухаємо подію 'input' (коли користувач щось вводить у поле гривень
  inputUa.addEventListener("input", () => {
    // Це спеціальний об'єкт у браузері, який вміє ходити по мережі за даними без перезавантаження сторінки.
    const request = new XMLHttpRequest();

    // request.open(method,url,async,login,pass);
    // Метод GET означає "дай мені дані" (ми нічого не зберігаємо на сервері, тільки читаємо).

    // "POST" (Відправити / Створити)
    // Що робить: Відправляє нові дані на сервер, щоб сервер їх обробив і зберіг.

    //"PUT" та "PATCH" (Оновити / Змінити)
    // Що робить: Наказує серверу оновити інформацію, яка там вже існує.
    // PUT зазвичай означає "ось тобі повністю новий об'єкт, заміни ним старий",
    // а PATCH — "зміни тільки одне конкретне поле, наприклад, статус"

    // DELETE" (Видалити)
    // Що робить: Наказує серверу знищити певні дані.
    // Другий параметр — це адреса, де лежить наш файл із курсами валют.
    request.open("GET", "/src/js/current.json");

    // Це як прикріпити записку для сервера: "Будь ласка, знай,
    //  що ми хочемо спілкуватися форматом JSON і
    //  використовувати нормальне кодування (utf-8), щоб не було ієрогліфів".
    request.setRequestHeader("Content-type", "application/json; charset=utf-8");

    // Фізично відправляємо запит. Саме на цьому моменті браузер робить запит до файлу.
    request.send();

    request.addEventListener("readystatechange", () => {
      // readyState === 4 означає, що кур'єр повністю завершив свою роботу і повернувся.
      // status === 200 означає, що відповідь успішна ("OK"), файл знайдено і віддано.
      if (request.readyState === 4 && request.status === 200) {
        console.log(request.response);

        // Тут ми беремо текст, який приніс кур'єр (request.response), і за допомогою JSON.parse
        // перетворюємо його на звичайний об'єкт JavaScript, щоб з ним було зручно працювати.
        const data = JSON.parse(request.response);
        inputUsd.value = (+inputUa.value / data.current.usd).toFixed(2); //округлює результат до двох цифр після коми
      } else {
        inputUsd.value = "Щось не так!";
      }
    });

    // status-Це тризначне число, яке сервер видає як підсумок своєї роботи.
    // Це найшвидший спосіб зрозуміти, чи все пройшло успішно.(200-файдзнайдено,404: Файл не знайдено...)

    // statusText
    // response- Це дані, які повернув сервер.
    //     // readyState-Це число від 0 до 4, яке показує, де зараз знаходиться наш запит.
    //     0	UNSENT	Объект был создан. Метод open() ещё не вызывался.
    // 1	OPENED	Метод open() был вызван.
    // 2	HEADERS_RECEIVED	Метод send() был вызван, доступны заголовки (headers) и статус.
    // 3	LOADING	Загрузка; responseText содержит частичные данные.
    // 4	DONE	Операция полностью завершена.
  });
});
