"use strict";

window.addEventListener("DOMContentLoaded", () => {
  //працюємо з датами(всі дати зберігаються в мілесекундах починаючи з 1970років,а якщо треба до 1970 пишемо від'ємні значення)
  //коли працюємо з пистим значенням в даті то якщо ми відкриваємо в терміналі воно показує в UTC форматі
  //а коли на сайті то наш локальний час

  //UTC (Coordinated Universal Time) — це Всесвітній координований час.
  //  Це головний стандарт, за яким світ регулює годинники та час.
  // Точка відліку: UTC — це "нульова" точка

  const nowd = new Date();

  const now = new Date("2026-04-01");
   new Date.parse("2026-04-01");//метод який працює як звичаєне об'влення дати
   
  const noww = new Date(2026, 4, 1,20);
  const nowm = new Date(0);

  console.log(nowd);
  console.log(now);
  console.log(noww);
  console.log(nowm);

  //методи в даті(є ще але вони схожі на ці- типу секунди і хвилини)
  getFullYear(); //виводить нам тільки рік
  getMonth(); //виводить нам тільки місяць
  getDate(); //виводить нам тільки день
  getDay(); //виводить наш день тиждня, але починається з неділі рахунок(0)
  getUTCHours(); //виводить час вже не по вашому часовуму поясі

  getTimezoneOffset(); //отримуэмо рызницю між часовим поясом і UTC(в хвилинах)
  getTime(); //показує скільки мілесекунд пройшло з 1970

  //схожі методи але ми не отримуємо значення, а записуємо їх
  //все починається з set, a не get
  setHours(18);

  //дивимось на скільки часу наприклад знадоболось для знаходження різниці між кінцевою датою та початковою
  let start = new Date();
  for (let i = 0; i < 100000; i++) {
    let some = i ** 3;
  }
  let end = new Date();
  console.log(`time: ${end - start}millesekund`);
});
